var quotes=[
    'Да на тебе пробу негде поставить!',
    'Все свое достоинство ты уже отдала чужим мужикам!',
    'Ты – позор отца и слезы матери!',
    'Ты – качественная мужская подстилка!',
    'Вся твоя жизнь – это выслуживание сахарка у хозяина!',
    'Ни один нормальный мужик даже не посмотрит в твою сторону!',
    'Вся твоя привлекательность закончилась еще 10 мужиков назад!',
    'Связываться с тобой – позорить себя!',
    'Ты – моральный импотент!',
    'Обидеть женщину способен только импотент!',
    'Ты – импотент не в штанах, а в душе! (А может, и там и там!)',
    'Ты – позор родителей и их разорение!',
    'Ты не в состоянии самостоятельно обеспечить себя даже туалетной бумагой!',
    'За своей дерзостью ты скрываешь собственную несостоятельность!',
    'Ты не состоялся ни как человек, ни как мужчина!',
    'В отличие от моего, твое достоинство упало на дно!',
    'Ты аморальная, слабая и убогая личность!',
    'Все твои слова – это беспомощные попытки что-то доказать!',
    'Мне на тебя жалко смотреть!',
    'Не унижайся и не пытайся сказать что-то умное!',
    'Я бы тебя обидела, но природа это уже сделала за меня!',
    'Когда Бог создавал женщин, на тебе он решил сэкономить!',
    'Я бы тебя обидела, но просто посоветую посмотреть в зеркало!',
    'Твои слова – беспомощный лай грязной дворняжки!',
    'Удивительно, и умом не богата и лицом не вышла!',
    'В такое лицо и плюнуть жалко!',
    'Да на тебе пробу негде поставить!',
    'Все свое достоинство ты уже отдала чужим мужикам!',
    'Ты – позор отца и слезы матери!',
    'Ты – качественная мужская подстилка!',
    'Вся твоя жизнь – это выслуживание сахарка у хозяина!',
    'Ни один нормальный мужик даже не посмотрит в твою сторону!',
    'Вся твоя привлекательность закончилась еще 10 мужиков назад!',
    'Связываться с тобой – позорить себя!',
    'Если бы ты была умной, то мужик бы у тебя был порядочный!',
    'От умных женщин мужчины не уходят!',
    'Вот, смотришь на тебя и с первого взгляда кажется, что ты – дура! А смотришь потом и точно – дура дурой!',
    'С таким как ты приживется только убогая дворняжка!',
    'Ты никогда не добьешься успеха, потому что в тебе мало силы и мужского начала!',
    'Ты не способен удовлетворить женщину ни морально, ни в постели!',
    'Ты – позор любой, даже самой падшей женщины!',
    'Ты не мужчина, а безделушка временного пользования!',
    'Даже самая глупая в мире женщина не сможет с тобой быть счастливой!',
    'Ты не состоялся еще в утробе матери!',
    'В твои 40 лет стать мужиком тебе не дано!',
    'Ты настолько слаб и ты такой неудачник, что слушать твои слова мне даже не обидно!',
    'Вместо того чтобы лаять как дворовая собака, лучше пойди подумай над своими словами и той глупостью, с которой ты их произносишь!',
    'Пойди умойся и смой с себя этот идиотизм!',
    'Я раньше считал, что ты умная, а сейчас вижу, что ты всегда была дурой!',
    'В очереди за умом ты, видимо, была последняя!',
    'Каждый раз когда ты открываешь рот оттуда вылетает очередная порция помоев!',
    'Ты ведешь себя так, как будто выросла в публичном доме!',
    'Да, мозг у тебя есть, но ума в нем ни грамма!',
    'Вы заставляете меня жалеть о том, что однажды я решил принять вас на работу',
    'В моих глазах вы моментально потеряли квалификацию!',
    'Я считаю, что наша компания переплачивает вам, ведь ваша образованность не достойна такой заработной платы',
    'Мне кажется, что вы только что потратили свою премию!',
    'Я не позволю процветать невежеству в своем добросовестном коллективе!',
    'Вы – позор нашей компании!',
    'С вашими достижениями наша компания никогда не добьется успеха!',
    'Вы тянете наш коллектив и нашу компанию вниз!',
    'С тех пор как ты открыл рот, оттуда не перестает идти зловоние, как от помойной ямы!',
    'Лучше б ты не открывал рот, потому что все твои слова только показали насколько ты низок!',
    'Ты открыл рот и сразу поняла, что передо мной глупый человек!',
    'Твои слова не показали тебя с лучшей стороны!',
    'С тех пор как ты открыл рот, я изменил мнение о тебе в худшую сторону!',
    'Твои слова опустили тебя в моих глазах ниже некуда!',
    'Ты невероятно глуп раз считаешь, что все, сказанное тобой – умная речь!',
    'Ты не достоин даже моего взгляда!',
    'Я не потерплю такого унижения, чтобы подарить тебе свое внимание!',
    'Ты настолько низок, что я даже тебя не заметила сперва!',
    'В моих глазах ты – ничто!',
    'Для меня ты даже не мужчина!',
    'Я не хочу иметь дело с такой низкой сущностью, как ты!',
    'Глядя на тебя, я чувствую только лишь жалость!',
    'Терпеть не могу хамов, они мои конкуренты!',
    'Позвольте вас послать интеллектуально?',
    'Ты думаешь, что я действительно смогу с тобой провести время? Ну, наверное, думать – это не про тебя!'
]

function getRandomQuotes(size){
    if (size === 0 || size === undefined){
        return
    }

    var randomNumbers = []
    val randomQuotes = ArrayList<String>()
    val size = quotes!!.size
    val random = Random()
    var i = 0
    while (i < number && i < size) {
        var nextInt: Int?
            do {
                nextInt = Math.random()random.nextInt(size)
            } while (randomNumbers.includes(nextInt))
            randomQuotes.add(quotes!![nextInt!!])
        i++
    }
    println()
    println("randomQuotes: ")
    println(randomQuotes)
    println()
    return randomQuotes
}
https://rawgit.com/muratidinov/sudary/master/html/index.html
https://cdn.rawgit.com/muratidinov/sudary/master/html/index.html
https://github.com/{username}/{repo_name}/blob/master/{file_name}
https://github.com/muratidinov/sudary/blob/master/html/index.html
